[{"title": "NFL approves rule changes, to allow No. 0", "description": "March 29 (UPI) -- NFL owners approved several rule changes at the annual league meeting, clearing a path for  No. 0, uniforms play clock adjustments, and various other in-game and transaction-based modifications for 2023.", "image_url": "https://cdnph.upi.com/ph/st/th/2091680088029/2023/upi/2934e0904b3149514aef4c7264454027/v1.5/NFL-approves-rule-changes-to-allow-No-0.jpg?sec=1", "web_url": "https://www.upi.com/Sports_News/NFL/2023/03/29/NFL-rule-changes-passer-zero-football/2091680088029/"}, {"title": "Men's college basketball: FAU, San Diego St. to tip off unexpected Final Four", "description": "March 29 (UPI) -- Florida Atlantic, San Diego State, Miami and UConn will take the court Saturday night in a Final Four not many could conceive at the start of March Madness. The men's basketball tournament semifinals will air on CBS.", "image_url": "https://cdnph.upi.com/ph/st/th/6151680015900/2023/upi_com/d27c0d26c779599eb00767c375dbd848/v1.5/Mens-college-basketball-FAU-San-Diego-St-to-tip-off-unexpected-Final-Four.jpg?sec=1", "web_url": "https://www.upi.com/Sports_News/2023/03/29/college-basketball-FAU-San-Diego-State-Final-Four-basketball/6151680015900/"}, {"title": "Fritz, Sinner advance to Miami Open tennis quarterfinals", "description": "MIAMI GARDENS, Fla., March 28 (UPI) -- Top American Taylor Fritz fired eight aces and converted 3 of 4 break point opportunities to dispatch of Denmark's Holger Rune and clinch a spot in the 2023 Miami Open quarterfinals Tuesday in Miami Gardens, Fla.", "image_url": "https://cdnph.upi.com/ph/st/th/4551680029511/2023/upi/7731fcbc6cf693d59222faa562fcfd6f/v1.5/Fritz-Sinner-advance-to-Miami-Open-tennis-quarterfinals.jpg?sec=1", "web_url": "https://www.upi.com/Sports_News/2023/03/28/Fritz-Sinner-advance-Miami-Open-tennis/4551680029511/"}, {"title": "Bianca Andreescu of Canada hurts ankle at Miami Open, leaves in wheelchair", "description": "MIAMI GARDENS, Fla., March 28 (UPI) -- Bianca Andreescu's inspired run at the 2023 Miami Open, which included upsetting Maria Sakkari, ended in tears, as the No. 31 women's tennis player hurt her ankle and was wheeled off the court.", "image_url": "https://cdnph.upi.com/ph/st/th/8661680006416/2023/upi/0f52cef1c63245257dd85b34efdf0f86/v1.5/Bianca-Andreescu-of-Canada-hurts-ankle-at-Miami-Open-leaves-in-wheelchair.jpg?sec=1", "web_url": "https://www.upi.com/Sports_News/2023/03/28/Bianca-Andreescu-injury-Miami-Open-tennis/8661680006416/"}, {"title": "College basketball: South Carolina, Virginia Tech clinch spots in women's Final Four", "description": "March 28 (UPI) -- Aliyah Boston totaled 22 points, 10 rebounds and five assists to lead No. 1 overall seed South Carolina Gamecocks past the Maryland Terrapins and into the Final Four of the 2023 women's basketball tournament.", "image_url": null, "web_url": "https://www.upi.com/Sports_News/2023/03/28/South-Carolina-Virginia-Tech-Final-Four-basketball/8171680000995/"}, {"title": "Tennis: Tsitsipas, Pegula advance at 2023 Miami Open", "description": "MIAMI GARDENS, Fla., March 27 (UPI) -- Greece's Stefanos Tsitsipas fired a dozen aces and survived a late rally to beat Chilean Cristian Garin in a three-set tennis thriller and advance to Round of 16 at the 2023 Miami Open on Monday in Miami Gardens, Fla.", "image_url": null, "web_url": "https://www.upi.com/Sports_News/2023/03/27/Tsitsipas-Medvedev-advance-Miami-Open-tennis/6201679938956/"}, {"title": "Baltimore Ravens QB Lamar Jackson seeks trade; coach expects him to stay", "description": "March 27 (UPI) -- Baltimore Ravens quarterback Lamar Jackson requested a trade earlier this off-season, he tweeted Monday. Ravens coach John Harbaugh later told reporters he expects the quarterback to stay with the team in 2023.", "image_url": null, "web_url": "https://www.upi.com/Sports_News/NFL/2023/03/27/Lamar-Jackson-trade-coach-return-Ravens-NFL/2101679933145/"}, {"title": "Women's basketball: Caitlin Clark-led Iowa, LSU reach spots in NCAA Final Four", "description": "March 27 (UPI) -- Caitlin Clark continued her historic women's basketball tournament run, with a 41-point triple-double to lead Iowa past Louisville and into the Final Four. LSU beat Miami to claim the first national semifinal ticket.", "image_url": null, "web_url": "https://www.upi.com/Sports_News/2023/03/27/Clark-Iowa-LSU-Final-Four-basketball/4661679928904/"}, {"title": "Anthony Volpe, Yankees top prospect, makes opening day roster", "description": "March 27 (UPI) -- Shortstop Anthony Volpe, the New York Yankees' top prospect and No. 5 overall prospect, will be part of the 26-man opening day roster, the team announced.", "image_url": null, "web_url": "https://www.upi.com/Sports_News/MLB/2023/03/27/Yankees-prospect-Anthony-Volpe-opening-day-MLB/2341679920579/"}, {"title": "Miami, San Diego State clinch spots in unlikely men's basketball Final Four", "description": "March 27 (UPI) -- San Diego State and Miami clinched the final two victories of the Elite Eight to round out an unlikely Final Four field at the 2023 NCAA Division I men's basketball tournament in Houston.", "image_url": null, "web_url": "https://www.upi.com/Sports_News/2023/03/27/Miami-San-Diego-State-basketball-tournament/6511679914952/"}, {"title": "Two Japanese horses are in for Kentucky Derby; Japan also dominates in Dubai", "description": "March 27 (UPI) -- Two Japanese horses, plus winners in Kentucky and Louisiana, joined the likely Kentucky Derby field as a result of weekend racing; the Dubai World Cup program provided upsets, thrills and emotion.", "image_url": null, "web_url": "https://www.upi.com/Sports_News/2023/03/27/horse-racing-Japanese-Kentucky-Derby/4011679896027/"}, {"title": "Former F1 driver Piquet fined for racist, homophobic remarks about Hamilton", "description": "March 25 (UPI) -- Retired Formula One champion Nelson Piquet has been fined $953,000 by a Brazilian court for racist and homophobic comments he made against British Formula One race driver Lewis Hamilton.", "image_url": null, "web_url": "https://www.upi.com/Sports_News/2023/03/25/brazil-nelson-piquet-fined-homophobic-racist-comments/3461679770094/"}, {"title": "Andreescu upsets Sakkari in 2023 Miami Open tennis", "description": "MIAMI GARDENS, Fla., March 24 (UPI) -- Sweat poured onto the court as Bianca Andreescu fought off a gritty rally to upset Maria Sakkari in a 3-hour, 3-minute second round match at the 2023 Miami Open on Friday in Miami Gardens, Fla.", "image_url": null, "web_url": "https://www.upi.com/Sports_News/2023/03/24/Andreescu-upsets-Sakkari-Miami-Open-tennis/1811679682175/"}, {"title": "Memphis women's basketball player charged for handshake-line punch", "description": "March 24 (UPI) -- Memphis guard Jamirah Shutes punched opposing  player Elissa Brett in the face after an NIT women's basketball game and was charged with assault by the Bowling Green State University Police Department, officials.", "image_url": null, "web_url": "https://www.upi.com/Sports_News/2023/03/24/Memphis-player-punch-charged-basketball/3161679674342/"}, {"title": "Tennis animosity lingers amid Ukraine-Russia war, women players say", "description": "MIAMI GARDENS, Fla., March 24 (UPI) -- Animosity has arisen between women tennis stars related to the invasion of Ukraine, players said at the Miami Open. Cold exchanges are now the norm between players from the war-torn countries.", "image_url": null, "web_url": "https://www.upi.com/Sports_News/2023/03/24/tennis-ukraine-russia-animosity/5711679581436/"}, {"title": "Eagles, All-Pro tackle Lane Johnson agree to 1-year extension", "description": "March 24 (UPI) -- All-Pro offensive tackle Lane Johnson and the Philadelphia Eagles agreed to a one-year contract extension, his agency announced Friday morning.", "image_url": null, "web_url": "https://www.upi.com/Sports_News/NFL/2023/03/24/Eagles-Lane-Johnson-agree-extension/5941679671834/"}]